Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཡོངས་སུ་ལོངས་སྤྱོད་པའི་བར་དུ་འགྱུར་རོ། །
en: he can respond for an eon, and so forth, up until . . . he will enjoy this temple with its sandalwood courtyard.

source: ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ཡང་སྔར་ཇི་སྐད་བསྟན་པ་བཞིན་ནོ། །
en: As for the origin , cessation, and path, they are as previously taught.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མ་འོངས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the future.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་མ་འོངས་པའི་བསྐལ་པ་དཔག་ཏུ་མེད་པའི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands all of the buddhas, buddha realms, and beings of an immeasurable number of future eons.

source: མ་འོངས་པའི་བསྐལ་པ་གྲངས་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the buddhas, buddha realms, and beings of an innumerable , inconceivable, incomparable, inestimable, and inexpressible number of future eons.

source: མ་འོངས་པའི་བསྐལ་པ་དཔག་ཏུ་མེད་པའི་ཡང་དཔག་ཏུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་གྲངས་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དཔག་ཏུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། དཔག་ཏུ་མེད་པའི་བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་པ་ནས་མ་འོངས་པའི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་གི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the buddhas, buddha realms, and beings in an immeasurable number of immeasurable future eons, an innumerable number of immeasurable future eons, an inconceivable number of immeasurable future eons, an incomparable number of immeasurable future eons, and an inexpressible number of immeasurable future eons. In this way he genuinely knows the buddhas, buddha realms, and beings of the future eons all the way until the buddhas, buddha realms, and beings of an inexpressible number of inexpressible future eons.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་མ་འོངས་པ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be learned about this is called knowing the future, and that is what the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པ་མ་འོངས་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about his knowledge of the future,

source: དེ་ལྟ་བས་ན་འདིར་གང་གི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འདུག་པ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, with his unimpeded wisdom vision he will enjoy this temple with its sandalwood courtyard.

source: ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ཡང་ཇི་སྐད་བསྟན་པ་བཞིན་ནོ། །
en: As for the origin , cessation, and path, they are as previously taught.

source: ཁྱིམ་བདག་གཞན་ཡང་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ད་ལྟར་བྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the present.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ད་ལྟར་བྱུང་བའི་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands all of the buddhas, buddha realms, and beings to the east.

source: ད་ལྟར་བྱུང་བ་གྲངས་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པ་དང་། གཞན་གྱིས་མི་ལང་བ་དང་། བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ
en: He correctly understands the innumerable , inconceivable, incomparable, inestimable, and inexpressible number of present buddhas, buddha realms, and beings.

source: ད་ལྟར་བྱུང་བའི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་གི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands the buddhas, buddha realms, and beings of the present eon up to an inexpressible figure of inexpressible numbers.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ད་ལྟར་བྱུང་བ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be learned about this is called knowing the present , and

source: དེ་བཞིན་གཤེགས་པ་ད་ལྟར་བྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the present,

source: ཀུན་འབྱུང་དང་། འགོག་པ་དང་། ལམ་ཡང་ཇི་སྐད་བསྟན་པ་བཞིན་ནོ། །
en: As for the origin , cessation, and path, they are as previously taught.

source: ཁྱིམ་བདག་གཞན་ཡང་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of karma.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ལེན་པའི་ལས་བཞི་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the four types of adopted karmic actions.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: ཚེ་འདི་ལ་མྱོང་བར་འགྱུར་བའི་ལས་དང་། སྐྱེས་ནས་མྱོང་བར་འགྱུར་བ་དང་། ལན་གྲངས་གཞན་ལ་མྱོང་བར་འགྱུར་བ་དང་། མྱོང་བར་མི་འགྱུར་བའི་ལས་ཤེས་སོ། །
en: They are the karma experienced in this life, the karma experienced in the next life, the karma experienced in subsequent lives, and the karma that is not experienced.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ལས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be learned about this is called knowing karma , and

source: དེ་བཞིན་གཤེགས་པ་ལས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about this

source: ལོངས་སྤྱོད་པའི་བར་དུ་འགྱུར་རོ།། །།
en: he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of karma.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ལས་དང་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of karma.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་ནས། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་བལྟ་བར་གནས་པའི་བར་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of karma,

source: བསྐལ་པར་ལན་གསུང་པ་ནས།
en: he can respond for an eon, and so forth, up until . . .

source: ལོངས་སྤྱོད་པའི་བར་དུ་འགྱུར་རོ། །
en: he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of karma.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པའི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ལ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of karma.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of karma.

source: དེ་བཞིན་གཤེགས་པ་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of karma,

source: དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of karma.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་ལས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད་མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of karma.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་བལྟ་བར་གནས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance, the Thus-Gone One correctly understands.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of karma.

source: དེ་བཞིན་གཤེགས་པ་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of karma,

source: བསྐལ་པར་ལན་གསུང་ཞིང་། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of adopted actions.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ལེན་པའི་ལས་བཞི་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands four types of adopted karmic actions.

source: ད་ལྟར་བྱུང་བ་ན་ཡང་སྡུག་བསྔལ་ལ། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་ཡང་དག་པར་ལེན་པའི་ལས་ཡོད་པ་དང་། ད་ལྟར་བྱུང་བ་ན་བདེ་ལ་ཕྱི་མ་ལ་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་ཡང་དག་པར་ལེན་པའི་ལས་ཡོད་པ་དང་། ད་ལྟར་བྱུང་བ་ན་སྡུག་བསྔལ་ལ་ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡང་དག་པར་ལེན་པའི་ལས་ཡོད་པ་དང་། ད་ལྟར་བྱུང་བ་ན་ཡང་བདེ་ལ་ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡང་དག་པར་ལེན་པའི་ལས་ཡོད་དོ། །
en: They are the adopted karmic actions where present suffering ripens into future suffering, where present happiness ripens into future suffering, where present suffering ripens into future happiness, and where present happiness ripens into future happiness.

source: ད་ལྟར་བྱུང་བ་ན་ཡང་སྡུག་བསྔལ་ལ་ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་ཡང་དག་པར་ལེན་པའི་ལས་གང་ཞེ་ན།
en: “What is the adopted karmic action where present suffering ripens into future suffering?

source: ཡང་དག་པར་ལེན་པའི་ལས་གང་དགེ་སྦྱོང་དང་བྲམ་ཟེ་མཁས་པ་རྣམས་ཀྱིས་སྨད་པ་འདི་ལྟ་སྟེ།
en: It is an adopted karmic action that is scorned by wise mendicants and brahmins.

source: མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་ལེན་པ་ཡིན་ཏེ།
en: It is to adopt the ten unvirtuous courses of action, which

source: དེ་ཡང་འདོད་ཆགས་དྲག་པོ་དང་། ཞེ་སྡང་དྲག་པོ་དང་། གཏི་མུག་དྲག་པོས་ཡང་དག་པར་བླངས་པ་ནི། དབུལ་བའི་སྡུག་བསྔལ་ཡང་དག་པར་བླངས་པ་ཡིན་ལ།
en: are adopted out of fierce desire, anger, and delusion, such that the suffering of poverty is also adopted.

source: དེ་ཡང་ཚེ་འདི་ཉིད་ལ་མཁས་པ་རྣམས་ཀྱིས་སྨད་པར་བྱ་བ་ཡིན་ཞིང་། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་མི་འདོད་པ་ཡིན་ཏེ
en: It is something that the wise must scorn in terms of this life, and not wish for in a future ripening.

source: ཡང་དག་པར་ལེན་པའི་ལས་འདི་ནི་ད་ལྟར་བྱུང་བ་ན་ཡང་སྡུག་བསྔལ་ལ། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་ཡིན་ནོ། །
en: This adopted karmic action entails suffering in the present and also as it ripens in the future.

source: ད་ལྟར་བྱུང་བ་ན་བདེ་ལ། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་ཡང་དག་པར་ལེན་པའི་ལས་གང་ཞེ་ན།
en: “What is the adopted karmic action where present happiness ripens into future suffering?

source: འདོད་ཆགས་དྲག་པོ་དང་། ཞེ་སྡང་དྲག་པོ་དང་། གཏི་མུག་དྲག་པོ་དང་། དབང་ཕྱུག་གི་དབང་གིས་ཡང་དག་པར་བླངས་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་བླངས་པ་ཡིན་ལ།
en: It is to adopt the ten unvirtuous courses of action due to fierce desire, anger, and delusion, or because of an Almighty.

source: དེ་ཚེ་འདི་ཉིད་ལ་ལོངས་སྤྱོད་ཀྱི་གྲངས་སུ་འགྱུར་ཞིང་། བྱིས་པ་རྣམས་ཀྱིས་ཀྱང་བསྔགས་ལ།
en: In this life it may be classified as pleasant, and childish beings will praise it. However,

source: མཁས་པ་རྣམས་ཀྱིས་ནི་སྨད་ལ། ཕྱི་མ་ལ་ཡང་མི་འདོད་པ། མི་སྡུག་པ་དག་ཏུ་འགྱུར་ཏེ
en: the wise will scorn it as in the future it brings unwanted consequences and turns into suffering.

source: བྱིས་པ་རྣམས་ཀྱིས་བསྔགས་ལ། མཁས་པ་རྣམས་ཀྱིས་སྨད་པ་ཡང་དག་པར་ལེན་པའི་ལས་འདི་ནི་ད་ལྟར་བྱུང་བ་ན་བདེ་ལ། ཕྱི་མ་ལ་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་ཡིན་ནོ། །
en: This adopted karmic action that is praised by childish beings and scorned by the wise is pleasant in the present but painful in the future.

source: ད་ལྟར་བྱུང་བ་ན་ཡང་སྡུག་བསྔལ་ལ། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡང་དག་པར་ལེན་པའི་ལས་གང་ཞེ་ན།
en: “What is the adopted karmic action where present suffering ripens into future happiness?

source: འདོད་ཆགས་དྲག་པོ་དང་། ཞེ་སྡང་དྲག་པོ་དང་། གཏི་མུག་དྲག་པོ་གང་དག་སོ་སོར་རྟོག་པ་འདིས་ལས་ཀྱི་རོ་མྱང་བ་ལ་ཞུགས་ལ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་བླངས་ཏེ
en: It is to adopt the ten virtuous courses of action while still being immersed in the experience of actions due to involvement with fierce desire, anger, and delusion.

source: དབུལ་བ་ཟིལ་གྱིས་མནན་ནས་
en: while overcome by the experience of poverty,

source: ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པ། མཁས་པ་རྣམས་ཀྱིས་བཟུང་བ། སྡུག་བསྔལ་ལ་བཟོད་པ། ཡིད་མི་བདེ་བ་ལ་བཟོད་པ། དགེ་བའི་ཕྱོགས་ཡང་དག་པར་ལེན་པ། འཕགས་པའི་ཆོས་ཡང་དག་པར་ལེན་པ་སྟེ།
en: one still adopts a proper outlook. The learned ones will embrace this situation, enduring suffering and what is unpleasant, while adopting all that is virtuous, including the noble Dharma.

source: ཡང་དག་པར་ལེན་པའི་ལས་འདི་ནི་ད་ལྟར་བྱུང་བ་ན་སྡུག་བསྔལ་ལ། ཕྱི་མ་ལ་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡིན་ནོ། །
en: This is the adopted karmic action where present suffering ripens into future happiness.

source: ད་ལྟར་བྱུང་བ་ན་ཡང་བདེ་ལ། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡང་དག་པར་ལེན་པའི་ལས་གང་ཞེ་ན།
en: “What is the adopted karmic action where present happiness ripens into future happiness?

source: འདོད་ཆགས་ཆུང་བ་དང་། ཞེ་སྡང་ཆུང་བ་དང་། གཏི་མུག་ཆུང་བ་དང་། ཤེས་རབ་གསལ་བ་གང་དག་གིས་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པ་སྟེ།
en: It is to adopt a proper mindset based on having few desires, little anger, and little delusion, combined with a bright intelligence.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་བླངས་ཤིང་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་ཀྱང་། དབང་ཕྱུག་དང་རྒྱགས་པ་ཟིལ་གྱིས་མནན་ནས། དགེ་བའི་ཕྱོགས་ཀྱི་གཞི་ལ་གནས་པའོ། །
en: One adopts the path of the ten virtues and enjoys perfect circumstances, yet one is not under the influence of an Almighty, or haughtiness, but one is grounded in virtue.

source: དེ་ཚེ་འདི་ཉིད་ལ་ཡང་བདེ་ལ་ཡོ་བྱད་བདེ་བ་ཉམས་སུ་མྱོང་ཞིང་མཁས་པ་རྣམས་ཀྱིས་ཀྱང་བསྟོད་པ་ཡིན་ལ།
en: Already in this life one will be happy and experience pleasant circumstances, while being praised by the learned.

source: ཕྱི་མ་ལ་ཡང་དེའི་འདོད་པ་དང་། སྡུག་པ་དང་། ཡིད་དུ་འོང་བར་འགྱུར་བ་ཡིན་ཏེ
en: In the future as well one’s experience will be desirable, beautiful, and pleasant.

source: ཡང་དག་པར་ལེན་པའི་ལས་འདི་ནི། ཚེ་འདི་ལ་ཡང་བདེ་ལ། ཕྱི་མ་ལ་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡིན་ནོ། །
en: This is the adopted karmic action where one is happy in this life and the future ripening is pleasant as well.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ཡང་དག་པར་ལེན་པ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: “To know, see, perceive, realize, understand, and be skillful about this is called knowing adopted actions , and

source: དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་ལེན་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of adopted actions,

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཆོས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of adopted actions.

source: ཁྱིམ་བདག་འདི་ལ་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of adopted actions.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་ནས། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་བལྟ་བར་གནས་པའི་བར་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་ལེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of adopted actions,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of adopted actions.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ལ། སྣང་བ་བྱས་ཤིང་མུན་པ་བསལ་ཏེ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them. He illuminated them and cleared away their darkness.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་ཡང་དག་པར་ལེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of adopted actions.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of adopted actions.

source: དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་ལེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of adopted actions,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་ལ། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of adopted actions.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་ཡང་དག་པར་ལེན་པ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of adopted actions.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་བལྟ་བར་གནས་པ་དེ།
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance,

source: དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་ལེན་པའི་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of adopted actions,

source: དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་། ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of abodes.

source: ལས་འདི་ལྟ་བུ་ནི་སེམས་ཅན་དམྱལ་བའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: ‘This action will ripen among the beings in hell.

source: ལས་འདི་ལྟ་བུ་ནི་དུད་འགྲོའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen among the beings in the animal realm.

source: ལས་འདི་ལྟ་བུ་ནི་གཤིན་རྗེའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the realm of the Lord of Death.

source: ལས་འདི་ལྟ་བུ་ནི་ལྷ་མ་ཡིན་གྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the demigod realm.

source: ལས་འདི་ལྟ་བུ་ནི་མིའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the realm of humans.

source: ལས་འདི་ལྟ་བུ་ནི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Heaven of the Four Great Kings.

source: ལས་འདི་ལྟ་བུ་ནི་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Heaven of the Thirty-Three.

source: ལས་འདི་ལྟ་བུ་ནི་འཐབ་བྲལ་གྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Heaven Free from Strife.

source: ལས་འདི་ལྟ་བུ་ནི་དགའ་ལྡན་གྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Heaven of Joy.

source: ལས་འདི་ལྟ་བུ་ནི་འཕྲུལ་དགའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Heaven of Delighting in Emanations.

source: ལས་འདི་ལྟ་བུ་ནི་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Heaven of Making Use of Others’ Emanations.

source: ལས་འདི་ལྟ་བུ་ནི་ཚངས་པའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the Abode of Brahmā.

source: ཚངས་རིས་ཀྱི་གནས་དང་། ཚངས་པ་མདུན་ན་འདོན་གྱི་གནས་དང་། ཚངས་པ་ཆེན་པོའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: These actions will ripen in the Brahmā Realm, the Heaven of the High Priests of Brahmā, and the Heaven of Great Brahmā, respectively.

source: ལས་འདི་ལྟ་བུ་ནི་འོད་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་གྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: These actions will ripen in the Heaven of Light, the Heaven of Limited Light, the Heaven of Limitless Light, and the Luminous Heaven, respectively.

source: ལས་འདི་ལྟ་བུ་ནི་དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་ཀྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: These actions will ripen in the Heaven of Virtue, the Heaven of Limited Virtue, the Heaven of Limitless Virtue, and the Heaven of Perfected Virtue, respectively.

source: ལས་འདི་ལྟ་བུ་ནི་ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: These actions will ripen in the Greater Heaven, the Heaven of Lesser Greatness, the Heaven of Limitless Greatness, and the Heaven of Great Fruition, respectively.

source: ལས་འདི་ལྟ་བུ་ནི་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། འོག་མིན་གྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: These actions will ripen in the Unlofty Heaven, the Heaven of No Hardship, the Sublime Heaven, the Gorgeous Heaven, and the Highest Heaven, respectively.

source: ལས་འདི་ལྟ་བུ་ནི་འདུ་ཤེས་མེད་པའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the abode of no notion.
